---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TableViewUIUtils Methods
TableViewUIUtils Class See Also Send Feedback
---

The TableViewUIUtils type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | TestCellAndPromptToEditTypeParameter | Prompts the end-user to control whether a type parameter contained in the specified table cell should be allowed edited. |

# See Also

TableViewUIUtils Class

Autodesk.Revit.UI Namespace